app/controllers/pages_controller.rb

	def index
		@posts = Post.limit(5)
---
SELECT  "posts".* FROM "posts" LIMIT 5