app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 245]]
---
	def show
    	@post = Post.find(params[:id])